<?php
error_reporting(0);

$string="設定語言校準背景鬧鐘時間關於本機返回生活方式精神不振放鬆可幫助放鬆每日的身心靈壓力服務目錄日期日期/時間關機?主頁/選擇放鬆運動運動後骨頭/關節適用於成長中、運動員及年長者，可幫助其強健骨骼、再生恢復。運動後修復精力充沛預防腦力器官的生理時鐘我的生理資訊女性/男性再生我的最愛編輯內容配件舒服內髒小孩永久年輕生物韻律經絡天氣變化骨頭抵抗力淋巴眼睛/視力調和經絡及平衡能量流動適用於成長中、運動員及年長者，可幫助骨骼新陳代謝。使用振動可提升免疫能力可幫助淋巴系統循環。淋巴系統是身體的重要防禦系統，也是免疫系統。推薦給用眼過度者。調和生物韻律可幫助兒童的體力和精神成長。用於抗氧化新陳代謝和永恆的青春。皮膚減肥美麗的肌膚，燦爛的外觀。經常使用可以幫助皮膚形成和皮膚再生。該計劃旨在幫助正確使用減肥方法和抗脂肪團治療。神經精神充能對於那些每天都需要完美心理功能和注意力的人。月經攝護腺賀爾蒙用於平衡荷爾蒙功能。內臟消化肝呼吸腎臟循環循環–短循環–長排毒痛疼可以幫助消化功能，並可以優化消化道的功能。為了正確有效的呼吸。建議運動員，吸煙者和生活在大城市的每個人使用。可幫助肝臟和排毒的正常運作。為了腎臟的正常運作和良好的排泄。一般建議協助血液流動。一天可以使用幾次。建議協助血液流動。一天可以使用幾次。用於協助身體的排毒功能。可幫助身體自我修復，可以減輕疼痛，並可以提高疼痛閾值。胰臟可幫助消化酶和產生胰島素的胰腺的正常功能。對於那些敏感，天氣狀況的突然變化。清新，年輕，精力充沛的精神和身體使用該程序可以緩解月經的不愉快症狀。適合成熟，中年和老年紳士。序列號版本舒曼共振痤瘡/粉刺病歷不安的夜晚休息2小時休息8小時睡覺呼吸系統疾病感冒咳嗽流感宿醉停止運行？改變語言？程序完成了！歡迎選擇程序刪除程序？程序已刪除！星期一星期二星期三星期四星期五星期六禮拜天設定更新了添加到最愛的從最愛中刪除取消肝肺臟大腸小腸胃脾臟心臟膀胱腎臟心包三重加熱器子午線膽囊喝300cc的水您可以通過USB連接安裝附件和升級。連接USB線USB連接請耐心等待…該器官還沒有可用的程序。此功能目前不可用。USB數據傳輸選擇聲音耳朵/聽力發燒創意唇瘡皰疹（長）消脂更漂亮。通過減少脂肪來優化新陳代謝。每天喝2.5升水，每天都要移動！泡疹可幫助於緩解唇皰疹的出現。可幫助於緩解唇皰疹的出現。需要創意嗎？讓你的想法飆升！可幫助於優化您的耳朵功能沒有日期格式選擇日期設置時間分鐘靜脈問題腸可幫助於維持健康的腸道菌群，並可能通過腸粘膜增強免疫系統。可幫助于支持静脉的最佳功能。对于那些整天站立的人。鬧鐘1鬧鐘2每天早上醒來都會精神煥發，開始新的一天。“每天早上醒來都會精神煥發，開始新的一天。鬧鐘鈴聲1鈴聲2鈴聲3鈴聲4鈴聲5選擇鈴聲單位正在升級非活動計劃該程序未激活。要激活它，請訪問我們的網上商店或任何Calivita配送中心。謝謝！激活程序這是正確的激活碼嗎？刪除激活碼？沒有鬧鐘完成了！早安！程序衝突升級失敗！升級成功！設定小時設定分鐘主選單此選單提供所有功能。輕輕點擊圖標，選單名稱出現在中間。再次點擊進入子選單。按下開/關按鈕1秒鐘，本機進入待機模式。要關閉設備，請按住開/關按鈕3-4秒，直到顯示屏上出現關機確認消息。選擇確定以關閉設備。子選單。返回上一個選單“啟動選單。啟動按鈕點擊圖標以設置自動運行程序。滾動文字向下滾動文字開啟/關閉光療，拖動滑塊進行亮度調節取消該程序。中斷正在運行的程序。該程序在後台持續運行，直到確認。繼續計劃取消程序，返回程序運行選單返回管風琴時鐘選單非活動滾動，頁面頂部自動運行在此選單中，您可以添加和管理自動運行的程序。在顯示屏的中間是按時間順序排列的自動運行程序。點擊所需的程序以查看詳細信息並更改或刪除它。電池旁邊的小圖標表示您是否將任何程序設置為自動運行。返回上一個選單返回主選單   添加程序自動運行開/關返回上一個選單設定節目日返回上一個選單返回主選單確認更改刪除程序向上滑動向下滾動向上滑動向下滾動向上滑動向下滾動改變語言通過點擊揚聲器圖標調整警報音量。報警關閉選擇程序非活動滾動，頁面底部非活動滾動，頁面頂部非活動滾動，頁面底部向後返回主選單   添加新代碼非活動滾動，頁面底部返回進入激活碼確認代碼向前向後請聯繫任何配送中心獲取新的充電器！你有敏感的牙齒或牙齦嗎？通過定期使用此程序來支持他們。更新可用！顯示設置在（秒）之後調暗顯示進入睡眠模式（秒）夜間模式開始於結束於呼吸道喉嚨護衛可以支持健康的上呼吸道健康，特別是當粘膜冷卻時。建議在冬天，或有冷飲或冰淇淋。程序結束信號程序結束音量設置激活夜間模式激活自動運行設置鬧鐘音量使用中央滑塊調節警報音量。要保存，請按右側的複選標記返回主選單確認設置夜間模式開/關向前向後確認設置返回主選單";
     $array=[];         
foreach( mb_str_split($string) as $key => $value ){
    $array[]= ordinal($value)."\n";
// echo mb_ord('ď', 'UCS-4BE')."\n";
}
$myArray=usort(array_unique($array));
//print_r(($array));
function uniord($s) {
    return unpack('V', iconv('UTF-8', 'UCS-4LE', $s))[1];
}

 function ordinal($str){
    $charString = mb_substr($str, 0, 1, 'utf-8');
    $size = strlen($charString);        
    $ordinal = ord($charString[0]) & (0xFF >> $size);
    //Merge other characters into the value
    for($i = 1; $i < $size; $i++){
        $ordinal = $ordinal << 6 | (ord($charString[$i]) & 127);
    }
    return $ordinal;
}

function mb_str_split( $string ) { 
    # Split at all position not after the start: ^ 
    # and not before the end: $ 
    return preg_split('/(?<!^)(?!$)/u', $string ); 
} 

for($i=0;$i<50000;$i+=10){
 
    foreach($array as $key=> $arr){
        if($arr>$i&&$arr<($i+10)){
           
            echo $i.'-'.($i+10)."\n";
            unset($array[$key]);
            break;
           
        }
    }
   
}
